<?php
//1. lsに「-l」オプションをつけて実行してみましょう。また、lsに他にどんなオプションが有るか調べてみましょう。

//ls -l
//オプション	機能
//-a	隠しファイル含めファイル全表示
//-A	「.」と「..」以外の隠しファイル含め全表示
//-l	詳細で表示
//-@	拡張属性の内容を表示
//-e	ACL設定がされているディレクトリを表示
//-h	サイズを適正な単位で表示
//-u	最終アクセス日を表示
//-U	作成された日時を表示
//-F	名前の末尾に種類を意味する記号を表示
//-t	日時を最近のものから並び替えて表示
//-R	サブディレクトリの内容も表示
//-S	サイズの大きいものから並び替えて表示
//-r	名前を降順に表示
//-d	指定したディレクトリの情報を表示
//-o	グループ名を省略して詳細表示
//-g	所有者名を省略して詳細表示
//-G	種類に応じて色を変更して表示

//2.echoコマンドの役割と使い方を調べてみましょう。

//$ echo 表示するもの

//3. echo 好きな文字列 > 好きなファイル名 を入力することで、好きなファイル名に好きな文字列を書き込むことができます。試してみましょう。
